/* 
    TASK 1

    У нас есть массив с самыми популярными вкусами чипсов.
    И каждый месяц у нас производится новый вкус. Закончите код до конца так,
    чтобы он определял и возвращай сорт, созданный последним 
    Важно: исходный массив не должен изменяться.
    var flavors = ['Краб', 'Сметана и зелень', 'Малосольные огурчики','Классический', 'С сыром', ‘Паприка'];

*/

/* 
    TASK 2
    
    У нас есть массив [1,2,3,4,5]. Необходимо развернуть этот массив БЕЗ СОЗДАНИЯ нового
    В итоге должно получиться: [5,4,3,2,1];
    Используйте только те конструкции, которые мы проходили на уроке.

*/

/* 
    TASK 3
    
    Есть список слов : [‘радар’,’вор’,’букет’,’доход’,’казак’,’варяг’,’потом’].
    Найти среди них палиндромы.

*/

/* 
    TASK 4
    
    Есть массив чисел : [444,123,-114,231,775,221,766,-557,0]. 
    Необходимо найти максимальное число и вывести его в консоль

*/

/* 
    TASK 5
    
    Пользователь вводит многозначное число. 
    Напишите функцию, которая принимает число в качестве аргумента
    и вставляет двоеточие (:) между двумя нечетными числами. 
    Например, если вводится число 55639217, то на выходе должно быть 5:563:921:7.

*/



